tutorials/QHDFoam/2D/backwardFacingStep/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            qhdFlux;
    }
    outlet
    {
        type           totalPressure;
        p0             $internalField;
        rho            rho;
        gamma          0.9;
        value          $internalField;
    }
    walls
    {
        type            qhdFlux;
    }
    symwall
    {
        type            empty;
    }
}


// ************************************************************************* //
